In [445]:
import pandas as pd

In [446]:
dict = {"imię": ["Marek", "Adam", "Jacek"], "wiek": [21, 36, 18]}

In [447]:
df = pd.DataFrame(dict)

In [448]:
df

    imię  wiek
0  Marek    21
1   Adam    36
2  Jacek    18

In [449]:
type(df)

pandas.core.frame.DataFrame

In [450]:
df = pd.read_csv("uczestnicy_kursu.csv", sep=";")

In [451]:
df

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    3.5   Ameryka
2   1002    Tim    41     USA    2.0   Ameryka
3   1003  Jenny    12  Niemcy    5.0    Europa

In [452]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   numer      4 non-null      int64
 1   imię       4 non-null      object
 2   wiek       4 non-null      int64
 3   kraj       4 non-null      object
 4   ocena      4 non-null      float64
 5   kontynent  4 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 324.0+ bytes

In [453]:
df.dtypes

numer          int64
imię          object
wiek           int64
kraj          object
ocena        float64
kontynent     object
dtype: object

In [454]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [455]:
df = df.set_index("numer")

In [456]:
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    3.5   Ameryka
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [457]:
df.index

Index([1001, 1000, 1002, 1003], dtype='int64', name='numer')

In [458]:
df.reset_index()

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    3.5   Ameryka
2   1002    Tim    41     USA    2.0   Ameryka
3   1003  Jenny    12  Niemcy    5.0    Europa

In [459]:
df.reset_index(drop=True)

    imię  wiek    kraj  ocena kontynent
0   Mark    55  Włochy    4.5    Europa
1   John    33     USA    3.5   Ameryka
2    Tim    41     USA    2.0   Ameryka
3  Jenny    12  Niemcy    5.0    Europa

In [460]:
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    3.5   Ameryka
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [461]:
df.columns

Index(['imię', 'wiek', 'kraj', 'ocena', 'kontynent'], dtype='object')

In [462]:
for c in df.columns:
    print(c)

imię
wiek
kraj
ocena
kontynent

In [463]:
df.drop(columns=["imię", "kraj"], index = [1000, 1003]) #drop- wyrzucenie czegoś

       wiek  ocena kontynent
numer
1001     55    4.5    Europa
1002     41    2.0   Ameryka

In [464]:
df.columns

Index(['imię', 'wiek', 'kraj', 'ocena', 'kontynent'], dtype='object')

In [465]:
df.drop("wiek", axis=1) # 1-usuwanie kolumny, 0-wiersz

        imię    kraj  ocena kontynent
numer
1001    Mark  Włochy    4.5    Europa
1000    John     USA    3.5   Ameryka
1002     Tim     USA    2.0   Ameryka
1003   Jenny  Niemcy    5.0    Europa

In [466]:
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    3.5   Ameryka
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [467]:
df = df.sort_index()
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [468]:
df.sort_values("kontynent")

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1002     Tim    41     USA    2.0   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1003   Jenny    12  Niemcy    5.0    Europa

In [469]:
df.sort_values(["kontynent", "wiek"])

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa
1001    Mark    55  Włochy    4.5    Europa

In [470]:
df.rename(columns={"imię": "Imię", "wiek": "Wiek"})

        Imię  Wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [471]:
df.T #transponowanie

numer         1000    1001     1002    1003
imię          John    Mark      Tim   Jenny
wiek            33      55       41      12
kraj           USA  Włochy      USA  Niemcy
ocena          3.5     4.5      2.0     5.0
kontynent  Ameryka  Europa  Ameryka  Europa

In [472]:
df.head(2)

       imię  wiek    kraj  ocena kontynent
numer
1000   John    33     USA    3.5   Ameryka
1001   Mark    55  Włochy    4.5    Europa

In [473]:
df.tail(2)

        imię  wiek    kraj  ocena kontynent
numer
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

# Wybieranie danych - metoda loc

In [474]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [475]:
df["imię"]

numer
1000     John
1001     Mark
1002      Tim
1003    Jenny
Name: imię, dtype: object

In [476]:
type(df["imię"])

pandas.core.series.Series

In [477]:
df[["imię"]]

        imię
numer
1000    John
1001    Mark
1002     Tim
1003   Jenny

In [478]:
df[["imię", "kraj"]]

        imię    kraj
numer
1000    John     USA
1001    Mark  Włochy
1002     Tim     USA
1003   Jenny  Niemcy

In [479]:
df.loc[:,["imię", "kraj"]] # : (od do) wszytskie wiersze

        imię    kraj
numer
1000    John     USA
1001    Mark  Włochy
1002     Tim     USA
1003   Jenny  Niemcy

In [480]:
df.loc[:1002,["imię", "kraj"]] # zamknięty przedział TU: df.loc

       imię    kraj
numer
1000   John     USA
1001   Mark  Włochy
1002    Tim     USA

In [481]:
df.loc[1001:,["imię", "kraj"]]

        imię    kraj
numer
1001    Mark  Włochy
1002     Tim     USA
1003   Jenny  Niemcy

In [482]:
df.loc[[1001,1002],["imię", "kraj"]]

       imię    kraj
numer
1001   Mark  Włochy
1002    Tim     USA

In [483]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [484]:
df.loc[1001:1002, "imię":"kraj"]

       imię  wiek    kraj
numer
1001   Mark    55  Włochy
1002    Tim    41     USA

In [485]:
df.loc[1001,"imię"]

'Mark'

In [486]:
df.loc[[1003,1000],:]

        imię  wiek    kraj  ocena kontynent
numer
1003   Jenny    12  Niemcy    5.0    Europa
1000    John    33     USA    3.5   Ameryka

In [487]:
df.loc[[1003,1000],"imię":"ocena"]

        imię  wiek    kraj  ocena
numer
1003   Jenny    12  Niemcy    5.0
1000    John    33     USA    3.5

In [488]:
df.loc[[1003,1000],["imię","ocena"]]

        imię  ocena
numer
1003   Jenny    5.0
1000    John    3.5

# Wybieranie danych na podstawie pozycji - metoda iloc

In [489]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [490]:
df.iloc[0,0]  # rb to samo co loc, ale pozycyjnie

'John'

In [491]:
df.iloc[:1,3:]

       ocena kontynent
numer
1000     3.5   Ameryka

In [492]:
df.iloc[:, [1,2]]

       wiek    kraj
numer
1000     33     USA
1001     55  Włochy
1002     41     USA
1003     12  Niemcy

# Wybieranie danych przy użyciu indeksowania logicznego

In [493]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [494]:
tf = (df["wiek"] > 40) & (df["kraj"] =="USA")
tf

numer
1000    False
1001    False
1002     True
1003    False
dtype: bool

In [495]:
df.loc[tf,:]

      imię  wiek kraj  ocena kontynent
numer
1002   Tim    41  USA    2.0   Ameryka

In [496]:
# operatory w pandasie !!
# and => &
# or => |
# not => ~
df[(df["wiek"] > 40) & (df["kraj"] =="USA")]

      imię  wiek kraj  ocena kontynent
numer
1002   Tim    41  USA    2.0   Ameryka

In [497]:
df[(df["wiek"] > 40) | (df["kraj"] =="USA")]

       imię  wiek    kraj  ocena kontynent
numer
1000   John    33     USA    3.5   Ameryka
1001   Mark    55  Włochy    4.5    Europa
1002    Tim    41     USA    2.0   Ameryka

# Ustawianie danych/przypisywanie wartości na podstawie pozycji

In [498]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [499]:
df2=df.copy()

In [500]:
# Lokalizuje/wyświetlam konkretną część tabeli
df2.loc[1000,"imię"]

'John'

In [501]:
# Lokalizuje i przypisuje konkretną wartość
df2.loc[1000, "imię"] = "JOHN"

In [502]:
df2

        imię  wiek    kraj  ocena kontynent
numer
1000    JOHN    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [503]:
df2.loc[[1000,1001],"ocena"]=[3,4]
df2

        imię  wiek    kraj  ocena kontynent
numer
1000    JOHN    33     USA    3.0   Ameryka
1001    Mark    55  Włochy    4.0    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

# Ustawianie danych/przypisywanie wartości przy użyciu indeksowania logicznego

In [504]:
df2

        imię  wiek    kraj  ocena kontynent
numer
1000    JOHN    33     USA    3.0   Ameryka
1001    Mark    55  Włochy    4.0    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [505]:
df2.loc[(df2["wiek"] < 19) & (df2["kraj"]=="Niemcy")] = "***"

In [506]:
df2

       imię wiek    kraj ocena kontynent
numer
1000   JOHN   33     USA   3.0   Ameryka
1001   Mark   55  Włochy   4.0    Europa
1002    Tim   41     USA   2.0   Ameryka
1003    ***  ***     ***   ***       ***

# Ustawianie danych poprzez zmianę wartości

In [507]:
df2 = df2.replace("USA", "Stany Zjednoczone")
df2

       imię wiek               kraj ocena kontynent
numer
1000   JOHN   33  Stany Zjednoczone   3.0   Ameryka
1001   Mark   55             Włochy   4.0    Europa
1002    Tim   41  Stany Zjednoczone   2.0   Ameryka
1003    ***  ***                ***   ***       ***

In [508]:
df2 = df2.replace({"kontynent": {"Ameryka" : "Ameryka Północna"}})

In [509]:
df2

       imię wiek               kraj ocena         kontynent
numer
1000   JOHN   33  Stany Zjednoczone   3.0  Ameryka Północna
1001   Mark   55             Włochy   4.0            Europa
1002    Tim   41  Stany Zjednoczone   2.0  Ameryka Północna
1003    ***  ***                ***   ***               ***

In [510]:
df2.replace(["JOHN", "Mark", 33], ["John", "Marek", 32])

        imię wiek               kraj ocena         kontynent
numer
1000    John   32  Stany Zjednoczone   3.0  Ameryka Północna
1001   Marek   55             Włochy   4.0            Europa
1002     Tim   41  Stany Zjednoczone   2.0  Ameryka Północna
1003     ***  ***                ***   ***               ***

# Ustawianie danych poprzez dodanie nowej kolumny

In [511]:
df2

       imię wiek               kraj ocena         kontynent
numer
1000   JOHN   33  Stany Zjednoczone   3.0  Ameryka Północna
1001   Mark   55             Włochy   4.0            Europa
1002    Tim   41  Stany Zjednoczone   2.0  Ameryka Północna
1003    ***  ***                ***   ***               ***

In [512]:
df2["rabat"] = 0
df2

       imię wiek               kraj ocena         kontynent  rabat
numer
1000   JOHN   33  Stany Zjednoczone   3.0  Ameryka Północna      0
1001   Mark   55             Włochy   4.0            Europa      0
1002    Tim   41  Stany Zjednoczone   2.0  Ameryka Północna      0
1003    ***  ***                ***   ***               ***      0

In [513]:
df2["rabat"] = [0,10,20,30]
df2

       imię wiek               kraj ocena         kontynent  rabat
numer
1000   JOHN   33  Stany Zjednoczone   3.0  Ameryka Północna      0
1001   Mark   55             Włochy   4.0            Europa     10
1002    Tim   41  Stany Zjednoczone   2.0  Ameryka Północna     20
1003    ***  ***                ***   ***               ***     30

In [514]:
df2 = df.copy()
df2

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [515]:
df2["rok urodzenia"] = 2023 - df2["wiek"]
df2

        imię  wiek    kraj  ocena kontynent  rok urodzenia
numer
1000    John    33     USA    3.5   Ameryka           1990
1001    Mark    55  Włochy    4.5    Europa           1968
1002     Tim    41     USA    2.0   Ameryka           1982
1003   Jenny    12  Niemcy    5.0    Europa           2011

# Brakujące dane

In [517]:
df3 = pd.read_csv("uczestnicy_kursu_nan.csv", sep=";")
df3

   numer  imię  wiek    kraj  ocena kontynent
0   1001  Mark  55.0  Włochy    4.5    Europa
1   1000  John  33.0     USA    NaN   Ameryka
2   1002   Tim  41.0     USA    2.0   Ameryka
3   1003   NaN   NaN     NaN    NaN       NaN

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   numer      3 non-null      float64
 1   imię       3 non-null      object
 2   wiek       3 non-null      float64
 3   kraj       2 non-null      object
 4   ocena      2 non-null      float64
 5   kontynent  3 non-null      object
 6   rabat      1 non-null      float64
dtypes: float64(4), object(3)
memory usage: 352.0+ bytes

In [ ]:
df3.isna()

   numer   imię   wiek   kraj  ocena  kontynent  rabat
0  False  False  False  False  False      False  False
1  False  False  False  False   True      False   True
2  False  False  False   True  False      False   True
3   True   True   True   True   True       True   True

In [ ]:
# Liczba wartości brakujących w każdej kolumnie
df3.isna().sum()

numer        1
imię         1
wiek         1
kraj         2
ocena        2
kontynent    1
rabat        3
dtype: int64

In [ ]:
# Liczbę wartości brakujących w całym data frame
df3.isna().sum().sum()

11

In [ ]:
df3 = df3.drop("rabat", axis=1)

In [ ]:
df3.columns

Index(['numer', 'imię', 'wiek', 'kraj', 'ocena', 'kontynent'], dtype='object')

In [ ]:
df3.dropna() # usuwa wiersz gdzie coś brakuje

    numer  imię  wiek    kraj  ocena kontynent
0  1001.0  Mark  55.0  Włochy    4.5    Europa

In [ ]:
df3

    numer  imię  wiek    kraj  ocena kontynent
0  1001.0  Mark  55.0  Włochy    4.5    Europa
1  1000.0  John  33.0     USA    NaN   Ameryka
2  1002.0   Tim  41.0     NaN    2.0   Ameryka
3     NaN   NaN   NaN     NaN    NaN       NaN

In [ ]:
df3=df3.dropna(how="all")

In [ ]:
df3

    numer  imię  wiek    kraj  ocena kontynent
0  1001.0  Mark  55.0  Włochy    4.5    Europa
1  1000.0  John  33.0     USA    NaN   Ameryka
2  1002.0   Tim  41.0     NaN    2.0   Ameryka

In [ ]:
df3 = df3.fillna({"ocena": df3["ocena"].mean()}) # uzupelnij brakujace
df3

    numer  imię  wiek    kraj  ocena kontynent
0  1001.0  Mark  55.0  Włochy   4.50    Europa
1  1000.0  John  33.0     USA   3.25   Ameryka
2  1002.0   Tim  41.0     NaN   2.00   Ameryka

In [ ]:
df3 = df3.fillna({"kraj": "No information"})
df3

    numer  imię  wiek            kraj  ocena kontynent
0  1001.0  Mark  55.0          Włochy   4.50    Europa
1  1000.0  John  33.0             USA   3.25   Ameryka
2  1002.0   Tim  41.0  No information   2.00   Ameryka

In [ ]:
df3

    numer  imię  wiek            kraj  ocena kontynent
0  1001.0  Mark  55.0          Włochy   4.50    Europa
1  1000.0  John  33.0             USA   3.25   Ameryka
2  1002.0   Tim  41.0  No information   2.00   Ameryka

# Zduplikowane dane

In [ ]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [ ]:
df[["kraj", "kontynent"]]

         kraj kontynent
numer
1000      USA   Ameryka
1001   Włochy    Europa
1002      USA   Ameryka
1003   Niemcy    Europa

In [ ]:
df.drop_duplicates(["kraj", "kontynent"])

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1003   Jenny    12  Niemcy    5.0    Europa

In [ ]:
df["kraj"].is_unique

False

In [ ]:
df.index.is_unique

True

In [ ]:
df["kraj"].unique()

array(['USA', 'Włochy', 'Niemcy'], dtype=object)

In [ ]:
df["kraj"].value_counts()

USA       2
Włochy    1
Niemcy    1
Name: kraj, dtype: int64

# Konkatenacja

In [ ]:
df

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    3.5   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    2.0   Ameryka
1003   Jenny    12  Niemcy    5.0    Europa

In [ ]:
data = [["Becky", 15, "Francja", 2.0, "Azja"],
        ["Paul", 44, "Kanada", 3.5, "Ameryka"]]

In [ ]:
more_users = pd.DataFrame(
    data=data,
    columns=["imię", "wiek", "kraj", "ocena", "kontynent"],
    index=[1000,1011]
)
more_users

       imię  wiek     kraj  ocena kontynent
1000  Becky    15  Francja    2.0      Azja
1011   Paul    44   Kanada    3.5   Ameryka

In [ ]:
pd.concat([df, more_users], axis=0)

       imię  wiek     kraj  ocena kontynent
1000   John    33      USA    3.5   Ameryka
1001   Mark    55   Włochy    4.5    Europa
1002    Tim    41      USA    2.0   Ameryka
1003  Jenny    12   Niemcy    5.0    Europa
1000  Becky    15  Francja    2.0      Azja
1011   Paul    44   Kanada    3.5   Ameryka

In [ ]:
pd.concat([df, more_users], axis=1)

,imię,wiek,kraj,ocena,kontynent,imię,wiek,kraj,ocena,kontynent
1000,John,33.0,USA,3.5,Ameryka,Becky,15.0,Francja,2.0,Azja
1001,Mark,55.0,Włochy,4.5,Europa,NaN,NaN,NaN,NaN,NaN
1002,Tim,41.0,USA,2.0,Ameryka,NaN,NaN,NaN,NaN,NaN
1003,Jenny,12.0,Niemcy,5.0,Europa,NaN,NaN,NaN,NaN,NaN
1011,NaN,NaN,NaN,NaN,NaN,Paul,44.0,Kanada,3.5,Ameryka

# Rodzaje joinów

In [ ]:
df1=pd.DataFrame(data=[[1,2],[3,4],[5,6]], columns=["A", "B"])
df2=pd.DataFrame(data=[[10,20],[30,40]], columns=["C", "D"], index=[1,3])

In [ ]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [ ]:
df2

    C   D
1  10  20
3  30  40

In [ ]:
# inner join
df1.join(df2,how="inner")

   A  B   C   D
1  3  4  10  20

In [ ]:
# outer join
df1.join(df2,how="outer")

     A    B     C     D
0  1.0  2.0   NaN   NaN
1  3.0  4.0  10.0  20.0
2  5.0  6.0   NaN   NaN
3  NaN  NaN  30.0  40.0

In [ ]:
# left join
df1.join(df2,how="left")

   A  B     C     D
0  1  2   NaN   NaN
1  3  4  10.0  20.0
2  5  6   NaN   NaN

In [ ]:
# right join
df1.join(df2,how="right")

     A    B   C   D
1  3.0  4.0  10  20
3  NaN  NaN  30  40